Tekla.Structures.Model.Operations.Operation.UnselectedModeEnum
Specifies what Tekla.Structures.Model.Operations.Operation.ShowOnlySelected(Tekla.Structures.Model.Operations.Operation.UnselectedModeEnum) should do to unselected parts.

Tekla.Structures.Model.Operations.Operation.UnselectedModeEnum.Hidden
Completely hide.

Tekla.Structures.Model.Operations.Operation.UnselectedModeEnum.Transparent
Make almost transparent.

Tekla.Structures.Model.Operations.Operation.UnselectedModeEnum.AsSticks
Show as sticks.